Revit 2027 API
DrawContext.GetOverrideColor Method
 Returns override color that will be applied to geometry during rendering.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool GetOverrideColor(
	out Color color
)
Public Shared Function GetOverrideColor (
	<OutAttribute> ByRef color As Color
) As Boolean
public:
static bool GetOverrideColor(
	[OutAttribute] Color^% color
)
static member GetOverrideColor :
        color : Color byref -> bool
Parameters
color Color
Return Value
Boolean
See Also
Reference
DrawContext Class
Autodesk.Revit.DB.DirectContext3D Namespace